{
    "lectures": [
        {
            "id": 0,
            "title": "Lectura 1: Fundamentos de ética profesional marítima",
            "file": "lecture_01.html"
        },
        {
            "id": 1,
            "title": "Lectura 2: Trípode filosófico – Sócrates, Aristóteles, Kant",
            "file": "lecture_02.html"
        },
        {
            "id": 2,
            "title": "Lectura 3: Sistema moral, conciencia y decisiones a bordo",
            "file": "lecture_03.html"
        }
    ],
    "activities": [
        {
            "id": 0,
            "title": "Actividad 1. Dilema Ético Marítimo",
            "file": "actividad_01.html"
        },
        {
            "id": 1,
            "title": "Actividad 2. Análisis Ético",
            "file": "actividad_02.html"
        },    {
            "id": 2,
            "title": "Actividad 3. Socialización y reflexión",
            "file": "actividad_03.html"
        },
        {
            "id": 3,
            "title": "Actividad 4: Análisis de casos reales",
            "file": "actividad_04.html"
        },
        {
            "id": 4,
            "title": "Reflexión final",
            "file": "actividad_05.html"
        }
    ],
    "flashcards": [
        { "f": "¿Qué distingue a la ética de la moral?", "b": "Ética: reflexión crítica universal; Moral: costumbres locales y subjetivas." },
        { "f": "¿Qué significa el término griego 'ethos'?", "b": "Carácter, modo de ser; credibilidad moral del profesional." },
        { "f": "¿En qué consiste la habituación reflexiva?", "b": "Formación del carácter mediante repetición consciente de actos éticos." },
        { "f": "Según Sócrates, ¿qué es el intelectualismo moral?", "b": "Doctrina que afirma que conocer el bien es suficiente para obrar bien; el mal es ignorancia." },
        { "f": "¿Qué es la phronesis en la ética aristotélica?", "b": "Sabiduría práctica para deliberar sobre el justo medio." },
        { "f": "¿Qué significa el justo medio (mesótes) según Aristóteles?", "b": "Equilibrio virtuoso entre dos extremos viciosos (exceso y defecto)." },
        { "f": "¿En qué consiste el imperativo categórico de Kant?", "b": "Obra según la máxima que puedas querer que se convierta en ley universal." },
        { "f": "¿Qué significa 'actuar por deber' en la ética kantiana?", "b": "Realizar una acción porque es moralmente correcta, no por conveniencia o recompensa." },
        { "f": "¿Qué es la conciencia ética?", "b": "Conocimiento profundo que lleva a actuar responsablemente incluso sin supervisión." },
        { "f": "¿Cómo se diferencia la lealtad mal entendida de la lealtad al cargo?", "b": "La lealtad verdadera es al cargo y la seguridad, no encubrir errores." },
        { "f": "¿Qué es la confianza acrítica?", "b": "Sesgo por el que la experiencia genera exceso de confianza e ignorar procedimientos." },
        { "f": "¿Qué significa trazabilidad en el contexto ético marítimo?", "b": "Documentar decisiones (fecha, lugar, fundamentos) para auditorías." },
        { "f": "¿Qué es la inteligencia cultural (CQ)?", "b": "Capacidad de relacionarse en contextos diversos respetando principios universales." },
        { "f": "¿Qué es la complacencia o normalización en seguridad?", "b": "Tendencia a aceptar desviaciones por repetición, erosionando la seguridad." },
        { "f": "¿Qué es una cultura justa?", "b": "Equilibra rendición de cuentas y aprendizaje (error vs negligencia)." },
        { "f": "Según Aristóteles, ¿qué principio debe aplicarse ante presión comercial?", "b": "La prudencia (phronesis) para hallar el justo medio entre temeridad y pasividad." },
        { "f": "¿Qué es la deontología?", "b": "Enfoque ético basado en deberes y reglas (códigos ISM, SOLAS)." },
        { "f": "¿Qué es el consecuencialismo?", "b": "Enfoque que pondera resultados y daños potenciales de una decisión." },
        { "f": "¿Qué significa 'tolerancia con criterio' en tripulaciones multiculturales?", "b": "Aceptar diferencias culturales sin vulnerar estándares éticos de seguridad y dignidad." },
        { "f": "¿Qué es un conflicto de interés?", "b": "Situación donde el juicio profesional puede estar influenciado por intereses secundarios." },
        { "f": "¿Por qué la corrupción es considerada un fallo sistémico?", "b": "No solo soborno; incluye negligencia, ausentismo, incumplimiento." },
        { "f": "Según Sócrates, ¿cuál es la causa del mal moral?", "b": "La ignorancia (amathia)." },
        { "f": "¿Qué es la eudaimonia para Aristóteles?", "b": "Florecimiento humano o vida lograda, fin último de la ética." }
    ],
    "quiz": [
        {
            "q": "Un oficial mercante, durante su tiempo libre en puerto, participa en una riña menor sin consecuencias legales graves. ¿Cuál es el principal problema ético?",
            "o": [
                "No hay problema porque fue en tiempo libre.",
                "Daña la reputación de la institución y la confianza pública.",
                "Solo es relevante si fue detenido.",
                "Es un asunto personal sin relación con su profesión."
            ],
            "c": 1,
            "e": "Correcto. El oficial siempre representa a su institución y a la profesión, incluso fuera de servicio; la confianza pública se erosiona con conductas inapropiadas."
        },
        {
            "q": "Un inspector de seguridad recibe un pequeño obsequio de un contratista después de una inspección favorable. ¿Cuál es la acción éticamente adecuada?",
            "o": [
                "Aceptarlo como gesto de cortesía.",
                "Reportar el incidente y rechazar cualquier obsequio de valor.",
                "Aceptarlo solo si es de bajo valor.",
                "Devolverlo discretamente sin informar."
            ],
            "c": 1,
            "e": "La transparencia y evitar conflictos de interés son fundamentales. Se debe reportar y establecer una política clara de no aceptar regalos."
        },
        {
            "q": "Según Aristóteles, ¿cómo debe actuar un capitán ante presión comercial por mantener la velocidad en condiciones climáticas adversas?",
            "o": [
                "Priorizar la velocidad para cumplir el cronograma.",
                "Reducir velocidad drásticamente por precaución extrema.",
                "Buscar un equilibrio: velocidad moderada con vigilancia reforzada.",
                "Seguir la orden de la naviera sin cuestionar."
            ],
            "c": 2,
            "e": "Aristóteles propone el justo medio: ni temeridad (exceso) ni cobardía (defecto). La prudencia (phronesis) permite ajustarse al contexto."
        },
        {
            "q": "Un capitán detecta una falla menor en un equipo de seguridad que debe ser reportada, pero la naviera le sugiere no hacerlo para evitar retrasos. Aplicando el imperativo categórico de Kant, ¿qué debe hacer?",
            "o": [
                "No reportar para ser leal a la empresa.",
                "Reportar porque si todos ocultaran fallas, el sistema colapsaría.",
                "Reportar solo si la falla empeora.",
                "Consultar con la tripulación y decidir por mayoría."
            ],
            "c": 1,
            "e": "Kant diría: obra según la máxima que puedas universalizar. Ocultar fallas no puede ser ley universal sin destruir la seguridad marítima."
        },
        {
            "q": "Un oficial con años de experiencia decide no seguir un procedimiento de seguridad porque 'siempre lo ha hecho así y nunca ha pasado nada'. ¿Qué concepto explica este comportamiento?",
            "o": [
                "Intelectualismo moral.",
                "Confianza acrítica.",
                "Phronesis.",
                "Deontología."
            ],
            "c": 1,
            "e": "Confianza acrítica: la experiencia previa exitosa genera exceso de confianza y lleva a ignorar procedimientos, aumentando el riesgo."
        },
        {
            "q": "Un maquinista detecta una pequeña fuga de aceite pero no la reporta para evitar papeleo. ¿Cuál es el problema ético principal?",
            "o": [
                "Es solo un problema técnico, no ético.",
                "La omisión de reportar puede tener consecuencias ambientales y de seguridad graves.",
                "Si la fuga es muy pequeña, no hay problema.",
                "El problema es solo si alguien se entera."
            ],
            "c": 1,
            "e": "La omisión consciente de reportar una falla, por pequeña que sea, es una falta ética porque vulnera la responsabilidad con el medio ambiente y la seguridad."
        },
        {
            "q": "Según el material de estudio, ¿cuál es la diferencia fundamental entre ética y moral?",
            "o": [
                "Son sinónimos.",
                "La ética es reflexión crítica universal; la moral son costumbres locales.",
                "La moral es reflexión; la ética son costumbres.",
                "La ética se aplica en el trabajo; la moral en la casa."
            ],
            "c": 1,
            "e": "La ética examina racionalmente la moral (normas culturales) y busca principios universales, mientras que la moral es el conjunto de costumbres de una comunidad."
        },
        {
            "q": "Un inspector presencia un derrame menor de aceite causado por un daño no reportado. El capitán le ruega que no informe. ¿Qué debe hacer el inspector?",
            "o": [
                "No reportar por empatía hacia el capitán.",
                "Reportar porque su deber legal y ético prevalece sobre la compasión personal.",
                "Reportar solo si el derrame es significativo.",
                "Sugerir al capitán que lo limpie y no decir nada."
            ],
            "c": 1,
            "e": "El inspector actúa como representante de la autoridad; debe priorizar su deber (MARPOL) y la protección ambiental sobre la empatía personal."
        },
        {
            "q": "¿Qué es la habituación reflexiva en la formación ética?",
            "o": [
                "Repetir actos sin pensar.",
                "Formar el carácter mediante repetición consciente y análisis de las acciones.",
                "Seguir las costumbres del entorno.",
                "Aprender de memoria los códigos de conducta."
            ],
            "c": 1,
            "e": "Es la repetición de actos éticos acompañada de reflexión sobre sus fundamentos, forjando así el carácter moral del profesional."
        },
        {
            "q": "¿Cuál de las siguientes situaciones ejemplifica una 'zona gris' ética en el ámbito marítimo?",
            "o": [
                "Descargar petróleo al mar violando MARPOL.",
                "No reportar una falla menor que no es obligatoria según la ley, pero podría afectar la seguridad a largo plazo.",
                "Robar en un puerto.",
                "Agredir a un subordinado."
            ],
            "c": 1,
            "e": "Las zonas grises surgen cuando la ley no es explícita o hay conflicto entre legalidad y responsabilidad ética, como en este caso."
        },
        {
            "q": "Según Sócrates, si un oficial mercante conoce la norma pero actúa mal, ¿cuál es la causa?",
            "o": [
                "Tiene mal carácter.",
                "Su conocimiento no es verdadero; es ignorancia.",
                "La norma es incorrecta.",
                "Actúa por debilidad de la voluntad."
            ],
            "c": 1,
            "e": "Sócrates sostiene que nadie obra mal a sabiendas; si actúa mal, es porque en realidad no conoce el bien (ignorancia)."
        },
        {
            "q": "¿Qué papel juega la familia en la formación ética según el material de estudio?",
            "o": [
                "Es irrelevante para la ética profesional.",
                "Proporciona los primeros valores morales que luego serán reflexionados éticamente.",
                "Enseña las normas técnicas de la profesión.",
                "Solo influye en la moral personal, no en la ética."
            ],
            "c": 1,
            "e": "La familia es el primer entorno donde se interiorizan valores (moral), base sobre la que luego se construye la reflexión ética profesional."
        },
        {
            "q": "¿Qué es la phronesis y por qué es crucial para un oficial mercante?",
            "o": [
                "Conocimiento técnico de los equipos.",
                "Virtud ética innata.",
                "Sabiduría práctica para deliberar y decidir correctamente en situaciones complejas.",
                "Cumplimiento estricto de reglas."
            ],
            "c": 2,
            "e": "Phronesis es la prudencia o inteligencia práctica que permite aplicar principios éticos a contextos cambiantes, esencial para el liderazgo a bordo."
        },
        {
            "q": "¿Cuál es la principal consecuencia de la complacencia en la cultura de seguridad de un buque?",
            "o": [
                "Aumenta la moral de la tripulación.",
                "Normaliza las desviaciones de los procedimientos, incrementando el riesgo de accidentes.",
                "Mejora la eficiencia operativa.",
                "Reduce los conflictos entre oficiales."
            ],
            "c": 1,
            "e": "La complacencia lleva a aceptar pequeñas desviaciones como 'normales', erosionando la seguridad y preparando el terreno para incidentes graves."
        }
    ],
    "summaryFile": "summary.html"
}